[{"Id": "76853", "ProductId": "B00002N8SM", "UserId": "A392XPUTJDHSDJ", "ProfileName": "T. Chang", "HelpfulnessNumerator": "3", "HelpfulnessDenominator": "4", "Score": "1", "Time": "1264896000", "Summary": "Doesn't catch fruit flies", "Text": "I don't know how this product performs with big flies but it sucks with fruit flies."}, {"Id": "76854", "ProductId": "B00002N8SM", "UserId": "A7E1DYOIQXM12", "ProfileName": "Hetal Rana", "HelpfulnessNumerator": "3", "HelpfulnessDenominator": "4", "Score": "1", "Time": "1246147200", "Summary": "Worthless Indoor Trap", "Text": "Ineffective and worthless. I bought this product for indoors and two other outdoor fly traps.  The outdoor traps worked immediately and I have noticed less flies in my home from my backdoor over the past week.  However, this indoor trap has caught zero flies yet over one week, while the outdoor traps have caught a combined 75-100.  I get excited looking at the trap thinking a fly was caught, but then realize that is the picture of a fly instead:-(.  Don't waste your money on this product."}, {"Id": "76855", "ProductId": "B00002N8SM", "UserId": "A8XKSGA2EA6GJ", "ProfileName": "T. Jackman", "HelpfulnessNumerator": "4", "HelpfulnessDenominator": "6", "Score": "1", "Time": "1255478400", "Summary": "Epic Fail - Worst Fly Trap Ever Created", "Text": "We had a problem with a lot of fruit flies in our kitchen.  I picked up one of these to take care of business despite spotty reviews.  Oops.<br /><br />We had it up for several days and I saw one fly land on it the entire time.  The best part of this tragic story is that when I picked up the trap to investigate the one trapped fly...I'l be darned if that fly didn't pick up his feet and take off. That's right, the fly flew away after landing on this.  None of the other flies in the area even bothered.<br /><br />They should call this the \"sucker\" trap.  The sucker in this case would be me.  Save your money and invest in quicker hand reflexes."}, {"Id": "76856", "ProductId": "B00002N8SM", "UserId": "AXVQSCC43HE99", "ProfileName": "Patricia J. Jaderborg \"Retired Weather Wizard\"", "HelpfulnessNumerator": "0", "HelpfulnessDenominator": "0", "Score": "3", "Time": "1348790400", "Summary": "It's OK. A fancy flypaper", "Text": "The picture was a bit misleading. I thought it was a trap where flies entered inside and were trapped, like a roach motel. When I received it, the design looked different, and it was obvious that it was a a square \"tube\" coated with very sticky adhesive, where the flies land and stick. As such, it works but not exactly what I expected. I would have designed it differently, though and put the adhesive on the inside and entrance holes on the outside so it doesn't look so ugly when the flies are caught."}, {"Id": "76857", "ProductId": "B00002N8SM", "UserId": "AZKXR73X1CVIM", "ProfileName": "A Concerned Mom", "HelpfulnessNumerator": "0", "HelpfulnessDenominator": "0", "Score": "1", "Time": "1348704000", "Summary": "Utterly worthless", "Text": "I put this fly trap in the kitchen and didn't catch a single fly.  We only have flies in late August and September when the temperature warms.  So we don't have window screens.  The flies were especially bad this year, so I tried the Victor fly trap because I like their rat and mouse traps and didn't want to spray in the kitchen.<br />Save your money and DON'T BUY THIS PRODUCT.  I caught many flies with a little milk in the bottom of a small water bottle.  They flew in and drowned themselves. I don't think California flies are smarter than any others so the trap just doesn't work."}, {"Id": "76858", "ProductId": "B00002N8SM", "UserId": "A3B28AM0CWI7BJ", "ProfileName": "BB in LA \"BB\"", "HelpfulnessNumerator": "0", "HelpfulnessDenominator": "0", "Score": "1", "Time": "1347753600", "Summary": "It's junk", "Text": "It never caught even one fly.  We got it for inside and left it out for a week.  The flies were not interested.  It's Useless!"}, {"Id": "76859", "ProductId": "B00002N8SM", "UserId": "A88YOFJG6IPOZ", "ProfileName": "duane", "HelpfulnessNumerator": "0", "HelpfulnessDenominator": "0", "Score": "1", "Time": "1343433600", "Summary": "RIpoff", "Text": "What a horrible product. First of all the item does not work. I have had it up for a week with lots of flies around it and they simply avoid it. Infact the will sit on the window next to it but never go to it. Also it does no look like the one pictured You get the idea that there are small boxes for the flies to enter. Not so. Mine came with black and pink srips running from the top to the bottom. WASTE OF MONEY"}, {"Id": "76860", "ProductId": "B00002N8SM", "UserId": "ASF1MKDA0N66O", "ProfileName": "M. Dawson \"flymaster\"", "HelpfulnessNumerator": "0", "HelpfulnessDenominator": "0", "Score": "1", "Time": "1342396800", "Summary": "Complete Waste of Money", "Text": "Flies buzz around this thing like its not even there. So many flies around, I'd think by luck a fly would have at least bounced off it and stuck by pure luck. Not a single fly caught, still flies annoyingly buzzing around the area.. Did NOT catch a single fruit fly, house fly, horse fly, mosquito or even a hungry spider or ant. Its a cardboard box worth about a nickel sprayed with some sticky stuff and this company is just laughing to the bank with our $7.<br />-- Chicago, Illinois"}, {"Id": "76861", "ProductId": "B00002N8SM", "UserId": "A1J67DKGFR7TZ4", "ProfileName": "ek8650", "HelpfulnessNumerator": "0", "HelpfulnessDenominator": "0", "Score": "1", "Time": "1341792000", "Summary": "I should read those reviews before ordered.", "Text": "Let's put in this way.  Flies stay on these traps and left.  It looks like a safe island to flies."}, {"Id": "76862", "ProductId": "B00002N8SM", "UserId": "A5W8ZREO7C1WK", "ProfileName": "Mireille", "HelpfulnessNumerator": "0", "HelpfulnessDenominator": "0", "Score": "1", "Time": "1340582400", "Summary": "Waste of money", "Text": "Please do not waste your money. This Fly trap is absolutely useless. I bought two of  this product for the kitchen, we always BBQ and go in and out by the Pool and fly's get in the House. We have started to make jokes about his product not ONE Fly so far has gone on both of them since i hang it up 2 weeks ago :) Terrible Product!"}, {"Id": "76863", "ProductId": "B00002N8SM", "UserId": "A17UIV0KM8JSV", "ProfileName": "S. Cohen", "HelpfulnessNumerator": "0", "HelpfulnessDenominator": "0", "Score": "1", "Time": "1337644800", "Summary": "Didn't work for me.", "Text": "Placed around the house for several days, setup a fly attracting trap in vicinity. literally watched the flies avoid this trap. after 2 days I was excited to see one lil'bugger land on the surface, only to be disappointed when I approached to examine and he flew away! the paper is tacky when the pressure of a human finger is applied, but for most small flies it is hardly a trap."}, {"Id": "76864", "ProductId": "B00002N8SM", "UserId": "A71C9WY0242QU", "ProfileName": "MeMeMe", "HelpfulnessNumerator": "0", "HelpfulnessDenominator": "0", "Score": "4", "Time": "1325376000", "Summary": "Gross but effective", "Text": "I've been nurturing a plant at work and it was doing so well I decided to repot to a larger pot. I must have gotten some funky soil because as soon as I repotted, we were being overrun by a large colony of small flies. I was swatting them and getting bug guts on my hand so frequently I stopped bothering with the \"gross!\" exclamations. The fact that in the city of San Francisco, you have to compost just aggravated the situation.<br /><br />I bought one of these nitfy traps and set it by my plant and voila! Instead of my hands getting the daily dose of bug guts, the trap is now lined with the tiny suckers! It's been a few months and the trap is pretty much covered (the gross part) and I need to order another one. Not sure how well this will work on larger inserts but it works really well on these tiny, annoying flies."}, {"Id": "76865", "ProductId": "B00002N8SM", "UserId": "A11DU8T1ZXPRT7", "ProfileName": "Zoggdogg", "HelpfulnessNumerator": "0", "HelpfulnessDenominator": "0", "Score": "1", "Time": "1319241600", "Summary": "Didn't work", "Text": "The only thing this item trapped was a few fruit flies.  It didn't work at all as a fly trap.  I wouldn't recommend it."}, {"Id": "76866", "ProductId": "B00002N8SM", "UserId": "A3R3T5T1K8IN6P", "ProfileName": "LILIAN J. DE CIAFFI", "HelpfulnessNumerator": "0", "HelpfulnessDenominator": "0", "Score": "5", "Time": "1315785600", "Summary": "THIS ITEM IS EXCELLENT TO KILL INSECTS", "Text": "I am so happy with this Item. I had too many flies that were disturbing in my kitchen. I put the product near the window and it works fantastically"}, {"Id": "76867", "ProductId": "B00002N8SM", "UserId": "A1VSEBVZS81UCI", "ProfileName": "Brian Haynes", "HelpfulnessNumerator": "0", "HelpfulnessDenominator": "0", "Score": "2", "Time": "1314748800", "Summary": "We have so many flies in the house.  Have had this product for 3 weeks and it has only stuck 1 fly thus far.", "Text": "We have so many flies in the house.  Have had this product for 3 weeks and it has only stuck 1 fly thus far."}, {"Id": "76868", "ProductId": "B00002N8SM", "UserId": "AUE8TB5VHS6ZV", "ProfileName": "eyeofthestorm", "HelpfulnessNumerator": "0", "HelpfulnessDenominator": "0", "Score": "1", "Time": "1306972800", "Summary": "A big rip off", "Text": "I wish I'd read the reviews before making this purchase. It's basically a cardsotck box that is sticky all over the OUTSIDE. Those pink-ish things that look like entrances \"into\" the trap? They're just pictures. There *is no* inside of the trap. All the flies will be stuck to the OUTSIDE. It's basically fly paper, just horribly, horribly HORRIBLY overpriced.<br /><br />Do yourself a favor and just get fly paper or fly strips. Same yuck factor, but much cheaper."}, {"Id": "76869", "ProductId": "B00002N8SM", "UserId": "A1FYH4S02BW7FN", "ProfileName": "wonderer", "HelpfulnessNumerator": "0", "HelpfulnessDenominator": "0", "Score": "1", "Time": "1290038400", "Summary": "Doesn't work!! Don't waste your money!!", "Text": "Worst product I have gotten in long time. Would rate it as no star if I could.  Simply did not catch a single fly or bug of any sort.  Went to the hardware store and bought the old-fashioned spiral fly paper which was very effective.  Had an unuasual influx of flys in the house this fall and needed to do something."}, {"Id": "76870", "ProductId": "B00002N8SM", "UserId": "A19Q006CSFT011", "ProfileName": "Arlielle", "HelpfulnessNumerator": "0", "HelpfulnessDenominator": "0", "Score": "1", "Time": "1288396800", "Summary": "only one fruitfly stuck", "Text": "I had an infestation of fruitflies, they were literally everywhere flying around me in my  kitchen, so I bought this product hoping to at least get rid of a few. But after 2 weeks, only 1 fly had stuck... I was going around with a notepad and squishing the buggers myself with a success rate of 2-3 a day so clearly this product was useless! I even dabbed to red wine and banana to the top of the column after 1 week because they were really attracted to any red wine I had in a glass... but still it did nothing to get them stuck. And then I actually saw a second fly land on it once, and I watched as it flapped it's wings frantically and within 30 secs it had unstuck itself!!!! This product was a total waste of money!"}, {"Id": "76871", "ProductId": "B00002N8SM", "UserId": "AIW48SP4GCIOO", "ProfileName": "Sandra M. Stasko", "HelpfulnessNumerator": "0", "HelpfulnessDenominator": "0", "Score": "1", "Time": "1287100800", "Summary": "Day 5 = Zero flies", "Text": "If I could rate this fly trap lower than one star, I would.  I think flies have come from miles away just to come in and laugh at this thing.  I'd have more success taking the flies into a vat of scalding water than getting a fly to randomly run into this box of ridiculousness.<br />WASTE OF $$!"}, {"Id": "76872", "ProductId": "B00002N8SM", "UserId": "A2B7IZJ243KWFX", "ProfileName": "S. Pawar", "HelpfulnessNumerator": "0", "HelpfulnessDenominator": "0", "Score": "1", "Time": "1286236800", "Summary": "get something else", "Text": "bought this awhile ago, decided to review it now.  this thing sucks.  there has been flies caught on this, but took over a year to get maybe, 10 or so tiny microscopic flies.  no regular flies that you can see with your eyes.  i still have it up, only cause it catches flies a few times a year.  maybe i should let those little things fly around, or i could get a real fly trap, that actually works. :)"}, {"Id": "76873", "ProductId": "B00002N8SM", "UserId": "A1G98WP2G0CMC", "ProfileName": "RG77 \"RGarcia\"", "HelpfulnessNumerator": "0", "HelpfulnessDenominator": "0", "Score": "2", "Time": "1284768000", "Summary": "Fly Trap Doesn't Trap Much", "Text": "Used this fly sticky tape trap in the garage where we had a knat fly problem. We also had some fruit fly type  bugs flying around also. Our neghbor has a big fig tree that isn't pruned of taken care of and all the figs stay on the tree and rot till they dry. Smells really bad and attracts the flys that go into our garage because of its proximity to our garage. We put these up and only caught about 3 to four on each one. We had better results with the sticky traps that unravel. These caught much more knats."}, {"Id": "76874", "ProductId": "B00002N8SM", "UserId": "A3EAHSVSDAYQ2K", "ProfileName": "schmalyn", "HelpfulnessNumerator": "0", "HelpfulnessDenominator": "0", "Score": "3", "Time": "1283040000", "Summary": "Works okay...", "Text": "Like others have said, hanging this up is useless. You have to lie it down in an area where the flies like to land. I have caught dozens and dozens of flies with this, however I have noticed that some of these traps are stickier than others. The flies in my house also seem to have figured out how to basically \"walk\" down the trap until they get to the end, where they can get unstuck and fly off. Maybe 25% of the flies escape, and the others are trapped. I actually have taken to pressing the flies into the trap once they land, to try to keep them from escaping, but this is disturbing and I'd rather not have to do that. The Catchmaster Window glue trap is really superior to this product by comparison (but is currently unavailable...)."}, {"Id": "76875", "ProductId": "B00002N8SM", "UserId": "A2WWCCK2PTY3SE", "ProfileName": "Wampag", "HelpfulnessNumerator": "0", "HelpfulnessDenominator": "0", "Score": "1", "Time": "1282348800", "Summary": "Is this a Joke", "Text": "Okay so I have a little garden in my back yard that attracts a lot of flies and I have been looking for a way to combat them once they are in the house. I wasn't sure if they still made Fly Paper but when I saw this after searching in the great Amazon I was excited. From the moment I opened the box I was dismayed and I seriously cannot decide if this is a joke or not. The packaging says the box has stunning 3-d images to draw in the flies, these images are perhaps the funniest drawing's I have ever seen being called 3-d...this product has not caught a single fly they simply ignore it and fly everywhere but at the stunningly realistic 3-d images anyone got a better idea?<br /><br />DO NOT BUY THIS UNLESS PLAYING A joke on someone"}, {"Id": "76876", "ProductId": "B00002N8SM", "UserId": "A23KO0L75SEQ3K", "ProfileName": "I. Bloch \"BigdogNJ\"", "HelpfulnessNumerator": "0", "HelpfulnessDenominator": "0", "Score": "1", "Time": "1282262400", "Summary": "Complete waste of money", "Text": "This is nothing more than a cardboard box with a little dry adhesive on the outside. It does nothing to attract flies and the adhesive is not gluey enough to trap them if they do happen to land on it. Save your money."}, {"Id": "76877", "ProductId": "B00002N8SM", "UserId": "A1J4110YC5IFAB", "ProfileName": "G. Smith \"gayeld\"", "HelpfulnessNumerator": "0", "HelpfulnessDenominator": "0", "Score": "1", "Time": "1280016000", "Summary": "Not so sticky situation", "Text": "I'm fairly certain that once caught, the flies are supposed stay stuck. Not so much with this trap. It's become part of our daily routine to compare how many flies there are on it in morning with how few are left in the afternoon. About 50% of them escape from it."}, {"Id": "76878", "ProductId": "B00002N8SM", "UserId": "A1GQUBNRZK3RHI", "ProfileName": "X. Li", "HelpfulnessNumerator": "0", "HelpfulnessDenominator": "0", "Score": "1", "Time": "1279411200", "Summary": "Doesn't work at all!", "Text": "This product does not work at all. I hang it in the kitchen for 5 days but no fly has been attracted!<br /><br />It doesn't worth the time and money to return it. But please, buyer beware, I strongly suggest you go find some other item."}, {"Id": "76879", "ProductId": "B00002N8SM", "UserId": "A2579IQYG8Y9YF", "ProfileName": "Cynthia", "HelpfulnessNumerator": "0", "HelpfulnessDenominator": "0", "Score": "5", "Time": "1244332800", "Summary": "Works Great!", "Text": "Having used traditional fly rolls in the past, I was dubious when my hubby opened up the box and showed me this little stand-alone cardboard fly trap. We were desperate, though, as we had a full-on gnat invasion in our kitchen. We put it in a few places on the counter before settling on one near the coffee pot where the gnats seemed to love to gather. At first they seemed to ignore it, but over the next few days, more and more were finding their way onto the trap. At one point we gave up counting--there were dozens. This product is great for ridding yourself of those pesky gnats. I love that it is poison-free and that it can stand on the countertop if you want it to, as our very tall ceilings would make a hanging strip less than useful. But for those wishing to hang it, there's a little hanger included as well. I can't make a claim about larger flies, we didn't catch any of those--there were none around. And I think there would be better choices for outdoors than this product. But for the $$ this little fly trap did the job we asked it to do, and you can't beat that!"}, {"Id": "76880", "ProductId": "B00002N8SM", "UserId": "A1S64UB4EOYFTK", "ProfileName": "Heather Paradee", "HelpfulnessNumerator": "0", "HelpfulnessDenominator": "0", "Score": "4", "Time": "1231027200", "Summary": "Prettier than fly paper", "Text": "Well I received the item and placed it in the same area where we had put fly paper before-we had far fewer victims than with the regular fly paper and it looks like it doesn't really catch \"the big ones\" like the fly paper did. However, for the price it is decent and looks more attractive than the regular strip of fly paper."}, {"Id": "76881", "ProductId": "B00002N8SM", "UserId": "A1LU93B4XI1PZZ", "ProfileName": "Christine K. Hall", "HelpfulnessNumerator": "0", "HelpfulnessDenominator": "0", "Score": "5", "Time": "1190073600", "Summary": "great product", "Text": "This sly trap is attractive to look at, works well, and has no odor. I recommend it!"}, {"Id": "76882", "ProductId": "B00002N8SM", "UserId": "A32DW342WBJ6BX", "ProfileName": "Buttersugar", "HelpfulnessNumerator": "0", "HelpfulnessDenominator": "0", "Score": "5", "Time": "948672000", "Summary": "A sure death for flies", "Text": "I bought a few of these after my apartment was infested with fruit flies. After only a few hours, the trap had &quot;attracted&quot; many flies and within a few days they were practically gone. This may not be a long term  solution, but if flies are driving you crazy, consider buying this. One  caution- the surface is very sticky, so try to avoid touching it."}, {"Id": "76883", "ProductId": "B00002N8SM", "UserId": "A29GWIJL72GXXZ", "ProfileName": "jon123", "HelpfulnessNumerator": "1", "HelpfulnessDenominator": "2", "Score": "1", "Time": "1270771200", "Summary": "ONLY CAUGHT 1 FLY", "Text": "Bought at my local Hardware Store.  I was having a terrible fly problem, and it only trapped one (1) fly (it's been over a year now, still hanging, still just the same one fly.<br /><br />DON'T BUY THIS PRODUCT!"}, {"Id": "76884", "ProductId": "B00002N8SM", "UserId": "A2281X5GBCKA6", "ProfileName": "Miss Emily \"Emily\"", "HelpfulnessNumerator": "1", "HelpfulnessDenominator": "2", "Score": "1", "Time": "1255737600", "Summary": "The coldn't care less!", "Text": "For something that was supposed to attract them, The flys couldn't have cared less. In about a months time it caught maybe 10 flies which sure were only a miniscule fraction of those in the kitchen! Was a waste of money."}, {"Id": "76885", "ProductId": "B00002N8SM", "UserId": "A1NH6UGER6N9EL", "ProfileName": "Snooze", "HelpfulnessNumerator": "1", "HelpfulnessDenominator": "2", "Score": "3", "Time": "1254268800", "Summary": "Random luck fly trap", "Text": "I don't really think that the design of the cardboard box makes one bit of difference to the flies. House or fruit flies. Flies land on pretty much anything. With sufficient time flies flying around randomly and landing randomly around the house. Eventually they'll land on the fly trap.<br /><br />Perhaps after the first few have landed and died on the trap the rest will be attracted to the scent of the dead flies? Directly out of the box, I don't think there is anything on it that is an attractant."}, {"Id": "76886", "ProductId": "B00002N8SM", "UserId": "A1CFZ6SHHRPRUY", "ProfileName": "Annette M. Davis \"A. Davis\"", "HelpfulnessNumerator": "1", "HelpfulnessDenominator": "2", "Score": "1", "Time": "1219276800", "Summary": "Not yet...", "Text": "Well, I purchased 3 as they were inexpensive and I figured for the shipping, I might as well. I have two up in to different areas of my small apartment and after 24 hours, nothing. I've managed to kill some flies but that was only by me swatting at them."}, {"Id": "76887", "ProductId": "B00002N8SM", "UserId": "AGF5R0NX88XPH", "ProfileName": "thebigE", "HelpfulnessNumerator": "1", "HelpfulnessDenominator": "2", "Score": "1", "Time": "1218153600", "Summary": "Doesn't work. I have 4 different types of traps, and this is the only one that is empty.", "Text": "Even the cheap 'ribbon' traps have caught many dozens of flies in the few days I've had them, and the liquid bait traps (Rescue, and Victor's Fly Magnet) have caught hundreds in a few days, but this thing remains empty (the best seems to be the Rescue trap, I call \"the stinker\", because it reeks, but it works). This trap is in the same space as the other traps, and there are hundreds of flies out there. Just does not work. While it is an \"indoor\" trap, the directions say that it can be used outdoors if protected by weather, which it is."}, {"Id": "76888", "ProductId": "B00002N8SM", "UserId": "A1L227LG53GTLB", "ProfileName": "M. A.", "HelpfulnessNumerator": "2", "HelpfulnessDenominator": "4", "Score": "1", "Time": "1171843200", "Summary": "Regular fly ribbon worked way better ...", "Text": "In the time I spent waiting for my order of these fly traps to arrive, I went out and bought regular fly ribbon for the bad fly problem (not sure what kind of flies - slightly bigger than fruit flies) I was having. In the at least week that I've had one of these fly traps up, I've caught zero flies with this fly trap and have caught probably over 100 flies with the regular fly ribbon. At one point, I even saw a fly on this fly trap and thought it was caught, but now it's gone. I even have pictures to prove it."}, {"Id": "76889", "ProductId": "B00002N8SM", "UserId": "A2Z0O52PKZPQ4H", "ProfileName": "river rat 222", "HelpfulnessNumerator": "1", "HelpfulnessDenominator": "3", "Score": "1", "Time": "1186876800", "Summary": "still waiting to catch a fly", "Text": "With hundreds of common house flies all about for 24 hours and not a single one caught I resorted to a fly swatter and killed 50 or so in 1-2 hours with my old fly swatter. This fly trap appears useless."}, {"Id": "76890", "ProductId": "B00002N8SM", "UserId": "A110QUC2ULFN7R", "ProfileName": "swatter", "HelpfulnessNumerator": "0", "HelpfulnessDenominator": "2", "Score": "1", "Time": "1186704000", "Summary": "This does not work...", "Text": "After a summer grill party where the door was kept open all day/ food was out on the countertops, we developed a horrible fly infestation in our home.  My husband bought this trap and it did not work, not one fly was caught.  I ended up putting a tiny smear of honey on one side and that actually worked, the next day I counted over 30 flies on the thing.  But by itself, it does nothing to 'attract' flies."}]